Autodesk.Revit.DB.FormaTriangleMeshArr.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormaTriangleMeshArr.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.FormaTriangleMesh})
Construct from an owned array of FormaTriangleMesh meshes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FormaTriangleMeshArr
A group of FormaTriangleMesh meshes belonging to one terrain representation.
Used to pass multiple per-representation mesh groups to pickBestFormaTerrainsForPolylines.